[


  
    
    {
      "title": "Ever 52-Hertz, Never companionless",
      "permalink": "http://0.0.0.0:4321/ever-52-hertz-never-companionless.html",
      "link": "http://0.0.0.0:4321/ever-52-hertz-never-companionless.html",
      "date": "2021-07-13T00:00:00-07:00",
      
        "modified": "2021-07-13T09:43:11-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p><img src=\"https://i.imgur.com/S1NruQF.jpg\" alt=\"head\" /></p>\n\n<p>Since when such ‘subtle’ adjustments softly crept into my social media life: Posted tweets turned inaccessible due to irrational accounts lockup; Accomplished blogs vanished without a single trace thanks to the sudden so-called maintenance; Collected Playlist shifted grey along with the expiration of platform’s copyright; Followed accounts collapsed overnight whilst the contents got blocked, and the usernames are gone; Subscribed videos should have been laying peacefully in cozy web couches whereas apart from unscrupulous advertisements the mere stuff left was unreasonable delete announcements…</p>\n\n<p>Shall I hate the platforms? Considering they provide us with a diversity of use case scenarios, perhaps I shouldn’t be too harsh on them. Nonetheless, in terms of exploiting users’ property to their profitable capital, imprisoning users in the scope of their services, monopolizing the jurisdiction on clients’ spiritual assets, the remained respects are long gone. Instead of employing dictatorship towards consumer resources, an optimal platform is preferred acting as a mere carrier and aggregator of digital contents— for customers themselves ought to be entitled to being responsible for their own options, spreading their own recognition as well as collecting their own preferences. Provided the platform fails to satisfy their demands, they can switch to another one. Users, at any time, shall be empowered to take away every single piece of the content properties. Most significantly, the output participants produce rather than the enormous scale the platform extends that counts, for it brings out restless vitality in a sketch-newly-established platform.</p>\n\n<p>Therefore, during the past three years, I’ve organized my personal blog along with two Fediverse instances; And now, with sincere help of everyone in our great team, we generate RSS3 and this RSS3 based program — Re:ID.</p>\n\n<p>In the world of RSS3, platforms are no longer THE ONLY RULE. Users, in fact, constitute the heart of our network-Rather than at all kinds of platforms’ mercy, POST FOR YOURSELF; Re:ID offers its users a compatible layer: Not only can they carry on followings and daily sharing through conventional platforms, but also be enabled to synchronize messages tweeting on RSS3 network, bursting cross-platform restraints and meanwhile preserving contents of their free will. Furthermore, in response to requirements about multi-platform and distinct content compositions, we are attaching multi-language/account/platform support for Re:ID, in the hope that different platforms may match corresponding accounts. We are developers as well as extension users, and users will continuously be the end that drives all demands and all our loyalty direct towards.</p>\n\n<p>Adopting Chrome/Chromium Plug-in developing strategies, we divide kernel codes into Content Script(webpage injection)/Background Service Worker(as its name suggests)/Popup Page(refers to minor ones)/Options Page four modules in total.</p>\n\n<ul>\n  <li>Content Script are in charge of anchoring the synchronize button on the webpage while simultaneously mounting hooks for event-Listeners. As users complete their delivering the subjects will be automatically uploaded and integrated into the RSS3 network.</li>\n  <li>Background Service Worker currently dominates evaluation regarding whether URL of the ongoing invoked label page is supported or not, additionally implement convert and modification to specific icons.</li>\n  <li>Popup Page plus Options Page produce grants and control for users when accessing resources, along with reveals of instruction information on webpages, it is quite convenient for users to realize functions such as detect/register/invite.</li>\n</ul>\n\n<p>Given that our network is currently located at the testing stage, membership of a fresh user requires an invitation from whom have participated in the program. Owing to our support for executions on the twitter platform, you may effortlessly deliver tweets involving your address at one click and waiting for invitations to join in; We will also continuously follow associated stamps ready to deliver our most sincere invitations for every user wish to give the brand new RSS3 ecosystem a shot.</p>\n\n<p>At present, Re:ID as our imaginary prototype already comprises elementary structure/executions/function characters, basically achieve compatibility with Twitter synchronization delivery, also on the shelf of Chrome Web Store(https://chrome.google.com/webstore/detail/re-id/hcioafpcjhamfeiegnnahpjnmnlilkil), which makes it more convenient for downloading and employing the steadily constructed version. Our team is constantly making best efforts to include support for more platforms, optimization for details, and realization for functions. With the iterations and cultivation of RSS3 protocol, more accomplishments for content are ever-evolving; Meanwhile, being a liberty-oriented/anti-centralization/anti-investigation software, Re:ID will maintain based on open source granted by GPL v3 (GitHub: https://github.com/NaturalSelectionLabs/Re-ID ). We welcome companions from the community to join our endeavor at any time, carry on contributing to the ever-flawless RSS3 world.</p>\n\n<p>The information turbulence is restlessly splitting our media space into isolated pieces. Monopoly platforms attempt to take every advantage of our resources; they intend to shape us into 52Hz whales that send out the companionless call. Nevertheless, we are no longer solitary. We haven’t been solitary. Our associations transcend platform bonds, our values surpass platform restrictions, we possess what we own from the beginning of our life: wisdom, passion, and courage; we create what we genuinely devote to.</p>\n\n<p>If you are interested in RSS3, and willing to participate in the environment cultivation, you may participate in discussion on Github or contact us in the following channel.</p>\n\n<p>Telegram:\n<a href=\"https://linktr.ee/rss3\">https://linktr.ee/rss3</a></p>\n\n<p>Discord:\n<a href=\"https://discord.gg/Wakve3zzkh\">https://discord.gg/Wakve3zzkh</a></p>\n\n<p>Twitter:\n[https://twitter.com/rss3<em>](https://twitter.com/rss3</em>)</p>",
      "excerpt": "",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  

  
    ,
    {
      "title": "The Flower We Saw That Day",
      "permalink": "http://0.0.0.0:4321/the-flower-we-saw-that-day.html",
      "link": "http://0.0.0.0:4321/the-flower-we-saw-that-day.html",
      "date": "2021-06-08T00:00:00-07:00",
      
        "modified": "2021-06-09T01:25:26-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p><img src=\"https://i.imgur.com/b5nSM08.png\" alt=\"head\" /></p>\n\n<p>Maybe ten years ago, an idea inspired me so much, called “The Spirit of the Internet”. I no longer remember where it originated, but everyone generally agrees that the Internet spirit should be open, equal, collaborative, and shared. It is as beautiful as a flower, which touched me as a young man, looking forward to the bright future of the Internet with these characteristics.</p>\n\n<p>But today, it is slowly being forgotten.</p>\n\n<p>Content platforms now hold the power of controlling how users disseminate, distribute and obtain contents. Platforms have built high walls, keeping user-generated contents inside as their own treasure. Users actively or forced to give up their rights and hand them over to the platforms. This leads to trashy platforms run wild, which is really unbelievable. When information loses its power to interconnect, “Internet” is no more than just a name.</p>\n\n<p>Platforms also control what can be created. Everyone should express their ideas freely, without being subject to any type of censorship or restriction from any centralized party. This is a fundamental human right and a basic right for any cyber persona. However, the reality is that platforms have complete control over what can and cannot be created and distributed. They can also remove contents that should belong to their creators at will.</p>\n\n<p>The Internet shouldn’t be like this.</p>\n\n<p>The original RSS was the perfect interpretation of the spirit of the Internet and the pioneer of the old era. But it has been having trouble adapting to the new generation. I deeply realized this in the process of developing and maintaining the open-source project RSSHub (<a href=\"https://github.com/DIYgod/RSSHub\">https://github.com/DIYgod/RSSHub</a>). It cannot solve the problems mentioned above since it has fatal issues in its original design. It keeps the original data still on content platforms. It lacks a way for users to connect with one another through contents and become almost impossible to introduce any business logic for developers and content creators to benefit from. Without fundamental changes, it is impossible to adapt to the new era and destined only for the minority.</p>\n\n<p>Therefore, the Internet needs a new open and inclusive protocol for building social and content networks. We call it RSS3. The proposal has been published on GitHub: <a href=\"https://github.com/NaturalSelectionLabs/RSS3\">https://github.com/NaturalSelectionLabs/RSS3</a></p>\n\n<ul>\n  <li>Change from XML to simplify and more efficient JSON</li>\n  <li>Cryptographic keypairs are used to authenticate and verify the integrity</li>\n  <li>Connections between users are recorded through links and backlinks</li>\n  <li>Content interactions are recorded through upstream and contexts</li>\n  <li>Contain different types of contents with mime_type</li>\n  <li>Paging through items_next and list_next to support storing more content</li>\n</ul>\n\n<p>For creators, everyone can upload RSS3 files that conform to the standard format to the distributed network, recording their personal information, relationships, and contents in the files, and hold the private key to hold the full ownership. Modifying permissions, publishing content, following other creators, and interacting with other contents only need users to alter their RSS3 files with ZERO interference from any centralized party.</p>\n\n<p>For applications, each one can obtain the contents from creators equally. That is, from the RSS3 files of creators. Applications can no longer monopolize and control the contents. Users can switch to any application at any time without worrying about losing existing contents.</p>\n\n<p>For distributed nodes, they will be hosting RSS3 files, maintaining the connections among RSS3 files and the reverse indexes of content interactions, storing permanent data such as transactions and contributions, and using a transparent algorithm to mark creators and content to achieve a user-controllable recommendation system, etc., of course, you can also get rewards for your own work.</p>\n\n<p>As for platforms, let them fade into history.</p>\n\n<p>Hope that RSS3 can help creators regain their own rights from centralized content platforms, making the Internet what it should be, and re-bring the flower we once saw but has forgotten its name.</p>",
      "excerpt": "",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  

  
    ,
    {
      "title": "Platformless Media",
      "permalink": "http://0.0.0.0:4321/platformless-media.html",
      "link": "http://0.0.0.0:4321/platformless-media.html",
      "date": "2021-05-26T00:00:00-07:00",
      
        "modified": "2021-05-26T10:28:39-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p>Media in the internet era has been all about platforms. If anyone tries to start gathering focus and influence by creating contents, no matter it’s your grandma or NYTimes, they need to start by thinking about what platform they want be start with. You want to shoot funny videos? Then TikTok is your place. You want to writing something showing your political point of view? Then Twitter is the place to go. But wait. What if you want your short videos to show on Snapchat and have their users to see them and subscribe to your contents? It turns out that you have to go to Snapchat and start a separate account there, and do it from scratch. And what if you write, say or show something TikTok, Twitter or Instagram don’t like? Well, that’s easy, they just delete that content. If it’s too much beyond the line, then your account will be banned — means that all your contents, all your subscribers and all effort behind them are gone, right after they hit that button.</p>\n\n<p>Let’s stop there and think about it. What is the ultimate logic between content creators and users? If we go to the most fundamental level here, there will be only two things: contents and links. Contents are the things creators produce which will draw interest from users. And links are the distribution logic that show users the contents they want to see, which also means send contents to users whom creators want to connect. In the scenario above, we see how platforms are taking these two most fundamental elements of any social media and controls it under their autocracy. Yeah, I know that’s how the world works, at least for now. But let’s once again back to the track, what is the most ideal social media ecosystem? To put it simple:</p>\n\n<p>① Creators should be entitled of right to control every bit of their content. If you like to post something, you post. If you like to edit something, you edit. If you like to delete something, you delete.</p>\n\n<p>② Whoever creates the link should have the full right to remove or carry the links to whichever application.</p>\n\n<p>With that in mind, we imagine a different way how media works in the future. You start with any application or “platform” without worrying about content form, application popularity or different policies. You simply start making contents and users from all around the world across all different applications can just see your content, interact with it, and become your follower. If for any reason you don’t want to use the first app you started with anymore, just take your identity and go to another app, everything you have, every fan you gathered will just be at the new place. YOU, no longer the platform, will be the one in control.</p>\n\n<p>This is how media becomes platformless: you will definitely still be working and interacting through apps, but they cannot kidnap you and your data anymore. They are just applications, not platforms.</p>\n\n<p>Here I have a diagram showing the current platform-centric or centralized system.</p>\n\n<p><img src=\"https://i.imgur.com/PRO3UWB.png\" alt=\"A Platform Centric System\" /></p>\n\n<p>This basically shows how platform holds and, of course, controls all contents and links, which is basically what caused the above problems.</p>\n\n<p>Here I also have a diagram for a user centric or distributed system.</p>\n\n<p><img src=\"https://i.imgur.com/zmP7KiB.png\" alt=\"A User Centric System\" /></p>\n\n<p>In this model, we can see how creators will be controlling their contents, and how users will be controlling their links or subscriptions. That is, creators fully control what to write and users fully control what to see. Platforms will disappear, leaving a place for different applications to compete users with different user experience.</p>\n\n<p>It is noticeable that both creators and users are considered users, which is becoming more and more common since everyone tends to create some content in these years on social medias. A distributed social media has a diagram like this:</p>\n\n<p><img src=\"https://i.imgur.com/WsvuJGp.png\" alt=\"A Distributed Social Media\" /></p>\n\n<p>Everyone has his/her/it/their own contents and links, and they control all of them. Still, in order for this thing to work, we need applications. Just like stated before, these applications will be competing with the same set of data but different user experience.</p>\n\n<p>Under this scenario, we can see how users will be the one in control. But there are problems when we rule out platforms.</p>\n\n<p>Platforms are not just evils, they have their values and that’s why they survived and thrived in the web 2.0 era. Normally, <strong>with the hope or the fact of gaining more profit</strong>, they do three things:</p>\n\n<ul>\n  <li>They build good products</li>\n  <li>They cover costs for the system</li>\n  <li>They promote certain services</li>\n</ul>\n\n<p>This is very straightforward. A platform is generally created by a company, starting with people investing some types of capitals: founders usually invest their time and effort and investors usually invest money. They share the risk of losing everything while also share the possibility of establishing a platform with strong network effect which will bring significant profit afterwards. Generally, they will have to build a good product, pay for it, and promote it for more users. So they do deserve reward in some extend.</p>\n\n<p>We have to be clear that users won’t choose a service simply due to the fact whether it is centralized, decentralized or distributed. At least that is not how users think now or in a near future. So in order for a distributed system to have massive adoption, we can’t expect less work than what a centralized platform does. Fundamentally, we will still need a economic incentive which will align different types of investments from different stakeholders: a drive that encourages better product(s), a way to cover necessary cost especially when the system costs more than it makes, and rewards for everyone that spreads the words.</p>\n\n<p>This will be the challenge we, who aim to build a distributed system, all face fighting against centralizations.</p>",
      "excerpt": "Media in the internet era has been all about platforms. If anyone tries to start gathering focus and influence by creating contents, no matter it’s your grandma or NYTimes, they need to start by thinking about what platform they want be start with. You want to shoot funny videos? Then TikTok is your place. You want to writing something showing your political point of view? Then Twitter is the place to go. But wait. What if you want your short videos to show on Snapchat and have their users to see them and subscribe to your contents? It turns out that you have to go to Snapchat and start a separate account there, and do it from scratch. And what if you write, say or show something TikTok, Twitter or Instagram don’t like? Well, that’s easy, they just delete that content. If it’s too much beyond the line, then your account will be banned — means that all your contents, all your subscribers and all effort behind them are gone, right after they hit that button.",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  

  
    ,
    {
      "title": "Recap All About That RSS3",
      "permalink": "http://0.0.0.0:4321/special-event-s2.html",
      "link": "http://0.0.0.0:4321/special-event-s2.html",
      "date": "2021-05-23T00:00:00-07:00",
      
        "modified": "2021-05-23T19:16:35-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p>From nothing to something, this is a story of what was achieved together, with you, with me and with every partner in the community. A huge thank you to everyone who came to the event yesterday. We are in the middle of a tremendous adventure and you are all part of it.  Let’s build the RSS3 Ecosystem together!</p>\n\n<p><img src=\"https://i.imgur.com/6iZ8lJp.png\" alt=\"https://i.imgur.com/6iZ8lJp.png\" /></p>\n\n<ul>\n  <li>\n    <p>RSS3 Stable v0.1.0 <a href=\"https://github.com/NaturalSelectionLabs/RSS3/blob/main/versions/v0.1.0.md\">Release</a></p>\n  </li>\n  <li>RSS3 Hub <a href=\"https://github.com/NaturalSelectionLabs/RSS3-Hub\">Release</a>\n Playground Endpoint: https://rss3-hub-playground-6raed.ondigitalocean.app\n Stable Version: Coming soon</li>\n  <li>RSS3 Hub SDK\n <a href=\"https://github.com/NaturalSelectionLabs/RSS3-SDK-for-JavaScript\">Javascript Version</a></li>\n  <li>RE:ID Chrome Extension\n Join us in the fiest take to liberate content</li>\n  <li>Towards the RSS3 Ecosystem\n    <ul>\n      <li>RSS3 Hub SDK Multi-lang implement</li>\n      <li>RSS3 native support Blog</li>\n      <li>RSS3 Feeds Reader</li>\n      <li>Static Site Generator Extension</li>\n      <li>Application</li>\n    </ul>\n  </li>\n</ul>\n\n<p>All the best</p>\n\n<p>Usagi &amp; The RSS3 Team</p>",
      "excerpt": "From nothing to something, this is a story of what was achieved together, with you, with me and with every partner in the community. A huge thank you to everyone who came to the event yesterday. We are in the middle of a tremendous adventure and you are all part of it.  Let’s build the RSS3 Ecosystem together!",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  

  
    ,
    {
      "title": "Stage One Roadmap",
      "permalink": "http://0.0.0.0:4321/stage-one-roadmap.html",
      "link": "http://0.0.0.0:4321/stage-one-roadmap.html",
      "date": "2021-05-12T00:00:00-07:00",
      
        "modified": "2021-05-13T23:40:29-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p>It is always important to share what we expect to achieve and the trajectory we plan to get there. Giving date promises has always been a bad idea since the level of uncertainties can always force the team to face a choice between missing the deadline or shipping something we are not proud of. So here, we will be talking about the things we are about to finish in the first stage of RSS3.</p>\n\n<p>We expect our work on RSS3 at this stage to be focusing on building the fundamentals of our protocol and product. So here are some of the most important things we will be working on, and their relative pace and sequence.</p>\n\n<p><img src=\"https://i.imgur.com/j8VyuWp.png\" alt=\"https://i.imgur.com/j8VyuWp.png\" /></p>\n\n<h3 id=\"rss3-10\">RSS3-1.0:</h3>\n\n<p>We will be shipping a stable version of RSS3 standard that is open, clean and efficient. It will be focusing on cyber personas and how they create and communicate information. The standard makes it possible for every cyber persona to be a information hub itself.</p>\n\n<h3 id=\"rss3-extension\">RSS3 Extension:</h3>\n\n<p>We will be building a browser extension that helps users painlessly create and update their RSS3 files in a fashion they are already familiar with. This is the first step towards a future where everyone will be posting on their RSS3 files.</p>\n\n<h3 id=\"rss3hub-alpha\">RSS3Hub Alpha:</h3>\n\n<p>We will be having a temporary centralized hosting and indexing service that handles our protocol design, testing and alpha testers. It will be like RSSHub (<a href=\"https://github.com/DIYgod/RSSHub\">https://github.com/DIYgod/RSSHub</a>) only for RSS3 plus indexing and update support. Also, there will be a web app for users to interact with the hub as well.</p>\n\n<h3 id=\"rss3hub-beta\">RSS3Hub Beta:</h3>\n\n<p>Right after the testing of RSS3Hub Alpha, we will be working on RSS3Hub Beta which will be distributed. Everyone will be able to run a node and contributed to the network. We will be giving some credits to people who join the beta test, which will be converted into tokens, if there is any.</p>\n\n<h3 id=\"superfollow-dapplet\">SuperFollow Dapplet</h3>\n\n<p>Together with Mask Network (<a href=\"https://mask.io/\">https://mask.io/</a>), we will create the SuperFollow Dapplett on Twitter which will add the Patreon feature on Twitter for any Mask and RSS3 users. The Dapplett will be truly decentralized and we expect it to be the first step for distributed content monetization for creators.</p>\n\n<p>These are the core things that we will be working on in the next 6 to 9 months, and more are yet to come.</p>\n\n<p>Stay tuned!</p>\n\n<p>Joshua &amp; The RSS3 Team</p>",
      "excerpt": "It is always important to share what we expect to achieve and the trajectory we plan to get there. Giving date promises has always been a bad idea since the level of uncertainties can always force the team to face a choice between missing the deadline or shipping something we are not proud of. So here, we will be talking about the things we are about to finish in the first stage of RSS3.",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  

  
    ,
    {
      "title": "Here comes RSS3",
      "permalink": "http://0.0.0.0:4321/here-comes-RSS3.html",
      "link": "http://0.0.0.0:4321/here-comes-RSS3.html",
      "date": "2021-05-11T00:00:00-07:00",
      
        "modified": "2021-05-12T22:38:19-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p>The right to create, disseminate and distribute information should not be in the hands of centralized governing. It is the basic right of cyber lives.</p>\n\n<p>Gradually over the past two decades, contents and links have been controlled by several data superpowers, who then eats all the profits, privacy and freedom. This centralization also resulted in a terrible environment of user experience innovations: No matter how well your design and engineer your application, there is no way to compete with the data monopolies.</p>\n\n<p>The world has been eager for a new way of constructing social and content networks. RSS used to be the pioneer of its time, now it’s time for us to pick up the baton and carry on.</p>\n\n<p>Derived from the best out of RSS, RSS3 is an open protocol designed for content and social networks in the Web 3.0 era.</p>\n\n<h2 id=\"the-ideologies-we-carry\">The Ideologies We Carry</h2>\n\n<h3 id=\"open-source\">Open Source</h3>\n\n<p>It goes without saying that the whole RSS3 project, including the standard and protocol itself and all other supporting layers like hosting and indexing should be open source. Everyone should have the right to inspect and understand what the code is and how it works. Also, being open-source gives all developers a direct way to contribute to all parts of the project.</p>\n\n<p>We will encourage all applications that utilize the protocol to be open-source as well. Otherwise, users won’t be trusting them with their valuable private keys. Chances are that malicious and non-open-source applications will be eliminated by market competitions while data monopoly no longer exists.</p>\n\n<p>Right now, people are forced to trust centralized parties for what a internet service actually does. There are of course big brands to trust, like Facebook, Google or Amazon. People used to have the idea that “big brands won’t cheat”, but recent incidents have all reminded us that giving anyone the chance to do evil is equally dangerous. We need transparency.</p>\n\n<h3 id=\"distributed-control\">Distributed Control</h3>\n\n<p>The old RSS was designed to be decentralized but not distributed. And that leads to super sub-centers which still carries too much power similar to centralized architectures. For example, Spotify hosts a great amount of long tail podcasts and, though it still uses RSS for publishing, controls all the RSS files and the audio files.</p>\n\n<p>The ultimate distributed control is to have every cyber persona control its own data. And this means both indexing files and content file should be under distributed hosting, and the right to edit the files are determined by their key pairs like in Bitcoin or Ethereum. However, it is important to note that this key pair that controls ownership can also be changed by their key holder, which will result in transferring or trading of a certain persona.</p>\n\n<p>That being said, we still need to keep in mind that general users will take a pretty long time to adopt this idea of keeping ones keys and controlling ones data with them. There will likely be a gradual process which involves efforts from multiple parties.</p>\n\n<h3 id=\"inclusiveness\">Inclusiveness</h3>\n\n<p>RSS3 and its applications are determined to win against the old giants, so it has to be inclusive in two major ways.</p>\n\n<p>It starts with the inclusiveness regarding types of applications. Any content or social network is defined by its content form and network structure, where network structure is determined by type of links and mechanism of discovery. Facebook, Twitter, Instagram, Whatsapp and TikTok are not that different technically. We need the protocol to support very different types of applications so that innovations can continue to happen.</p>\n\n<p>Then we need the inclusiveness on modules. Whether it is hosting, indexing or monetizing, RSS3 is designed to be extremely open to modules with different functionalities. This gives RSS3 great flexibility and possibility regarding what it can do in the future.</p>\n\n<h2 id=\"the-future-we-aim\">The Future We Aim</h2>\n\n<h3 id=\"empowered-personas\">Empowered Personas</h3>\n\n<p>Cyber personas will truly have full control regarding the data they produce. Any persona can freely express their thoughts and ideas without being censored by any centralized agency. You can go to any application with your own contents and relationships. No platform can ever force you to labor for it anymore. You, no longer the platform, will be empowered to create, own and monetize.</p>\n\n<h3 id=\"platformless-medias\">Platformless Medias</h3>\n\n<p>Medias right now are closely bonded with platforms. Each social media platform has its own social graph and primary form of content. The adoption of RSS3 will give medias a chance to have the largest unified group of subscribers, an efficient monetization channel without platform commission, and a freedom to generate contents of various forms.</p>\n\n<h3 id=\"innovative-applications\">Innovative Applications</h3>\n\n<p>Innovations on user experience has slowed down so dramatically as data superpowers continue to grow. We want to rebuild the prosperous ecology of applications for different user experience to emerge. When users control their data, they can easily choose to move to applications with better design and engineering efforts. Unlike competing for the scale and speed of data monopolizing, now applications will be actually competing for user experience.</p>\n\n<h2 id=\"the-team-we-build\">The Team We Build</h2>\n\n<p>To achieve what we aimed for, we formed a distributed organization with high standard. Every member works on RSS3 comes from his/her/their/its true belief and passion. We share the culture below:</p>\n\n<h3 id=\"mission\">Mission</h3>\n\n<p>To Liberates Contents and Links</p>\n\n<h3 id=\"vision\">Vision</h3>\n\n<p>Build a world where information and its flow are free, secure, efficient and distributed</p>\n\n<h3 id=\"value\">Value</h3>\n\n<ul>\n  <li>Neutrality</li>\n  <li>Inclusiveness</li>\n  <li>Equality</li>\n  <li>Security</li>\n  <li>Privacy</li>\n  <li>Meticulosity</li>\n</ul>\n\n<p>I first was working on an RSS related app in 2018, which led me to the famous RSS project on Github called RSSHub (<a href=\"https://github.com/DIYgod/RSSHub\">https://github.com/DIYgod/RSSHub</a>). The app failed badly and I did not anticipate the experience with that app would do me any favor. I worked on different types of social networks after that and gradually shifted my focus onto decentralized social and content networks. It was not until the second half of 2020, did I suddenly remembered RSSHub and its creator DIYgod (<a href=\"https://diygod.me/\">https://diygod.me/</a>). I connected with him and decided that we could carry some of the best from RSS and build something better. With great help from suji (<a href=\"https://twitter.com/suji_yan\">https://twitter.com/suji_yan</a>), founder at Mask Network, we were able to know more people in the decentralized world and raise our seed round. Suji was actually the first person advised us to change our project name (formerly AIR) to RSS3 :D</p>\n\n<h2 id=\"to-conclude\">To Conclude…</h2>\n\n<p>It is never easy to build something great. Especially when you are confronting the well established giants. However, as developers, we have a firm belief regarding what is right and what should be done. We must dedicate all what we have to overthrow the old world in order to build a new one.</p>\n\n<p>If you want to join us, know more about RSS3 or just want to have a talk, we are always happy to connect :D</p>\n\n<p>All the best ❤️</p>\n\n<p>— Joshua &amp; The RSS3 Team</p>",
      "excerpt": "The right to create, disseminate and distribute information should not be in the hands of centralized governing. It is the basic right of cyber lives.",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  


]
