[


  
    
    {
      "title": "Stage One Roadmap",
      "permalink": "http://0.0.0.0:4321/stage-one-roadmap.html",
      "link": "http://0.0.0.0:4321/stage-one-roadmap.html",
      "date": "2021-05-12T00:00:00-07:00",
      
        "modified": "2021-05-12T22:38:19-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p>It is always important to share what we expect to achieve and the trajectory we plan to get there. Giving date promises has always been a bad idea since the level of uncertainties can always force the team to face a choice between missing the deadline or shipping something we are not proud of. So here, we will be talking about the things we are about to finish in the first stage of RSS3.</p>\n\n<p>We expect our work on RSS3 at this stage to be focusing on building the fundamentals of our protocol and product. So here are some of the most important things we will be working on, and their relative pace and sequence.</p>\n\n<p><img src=\"https://i.imgur.com/j8VyuWp.png\" alt=\"https://i.imgur.com/j8VyuWp.png\" /></p>\n\n<h3 id=\"rss3-10\">RSS3-1.0:</h3>\n\n<p>We will be shipping a stable version of RSS3 standard that is open, clean and efficient. It will be focusing on cyber personas and how they create and communicate information. The standard makes it possible for every cyber persona to be a information hub itself.</p>\n\n<h3 id=\"rss3-extension\">RSS3 Extension:</h3>\n\n<p>We will be building a browser extension that helps users painlessly create and update their RSS3 files in a fashion they are already familiar with. This is the first step towards a future where everyone will be posting on their RSS3 files.</p>\n\n<h3 id=\"rss3hub-alpha\">RSS3Hub Alpha:</h3>\n\n<p>We will be having a temporary centralized hosting and indexing service that handles our protocol design, testing and alpha testers. It will be like RSSHub (<a href=\"https://github.com/DIYgod/RSSHub\">https://github.com/DIYgod/RSSHub</a>) only for RSS3 plus indexing and update support. Also, there will be a web app for users to interact with the hub as well.</p>\n\n<h3 id=\"rss3hub-beta\">RSS3Hub Beta:</h3>\n\n<p>Right after the testing of RSS3Hub Alpha, we will be working on RSS3Hub Beta which will be distributed. Everyone will be able to run a node and contributed to the network. We will be giving some credits to people who join the beta test, which will be converted into tokens, if there is any.</p>\n\n<h3 id=\"superfollow-dapplet\">SuperFollow Dapplet</h3>\n\n<p>Together with Mask Network (<a href=\"https://mask.io/\">https://mask.io/</a>), we will create the SuperFollow Dapplett on Twitter which will add the onlyfans feature on Twitter for any Mask and RSS3 users. The Dapplett will be truly decentralized and we expect it to be the first step for distributed content monetization for creators.</p>\n\n<p>These are the core things that we will be working on in the next 6 to 9 months, and more are yet to come.</p>\n\n<p>Stay tuned!</p>\n\n<p>Joshua &amp; The RSS3 Team</p>",
      "excerpt": "It is always important to share what we expect to achieve and the trajectory we plan to get there. Giving date promises has always been a bad idea since the level of uncertainties can always force the team to face a choice between missing the deadline or shipping something we are not proud of. So here, we will be talking about the things we are about to finish in the first stage of RSS3.",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  

  
    ,
    {
      "title": "Here comes RSS3",
      "permalink": "http://0.0.0.0:4321/here-comes-RSS3.html",
      "link": "http://0.0.0.0:4321/here-comes-RSS3.html",
      "date": "2021-05-11T00:00:00-07:00",
      
        "modified": "2021-05-12T22:38:19-07:00",
      
      "author": {
        "name": "RSS3",
        "url": "https://rss3.io/",
        "email": "contact@rss3.io"
      },
      "content": "<p>The right to create, disseminate and distribute information should not be in the hands of centralized governing. It is the basic right of cyber lives.</p>\n\n<p>Gradually over the past two decades, contents and links have been controlled by several data superpowers, who then eats all the profits, privacy and freedom. This centralization also resulted in a terrible environment of user experience innovations: No matter how well your design and engineer your application, there is no way to compete with the data monopolies.</p>\n\n<p>The world has been eager for a new way of constructing social and content networks. RSS used to be the pioneer of its time, now it’s time for us to pick up the baton and carry on.</p>\n\n<p>Derived from the best out of RSS, RSS3 is an open protocol designed for content and social networks in the Web 3.0 era.</p>\n\n<h2 id=\"the-ideologies-we-carry\">The Ideologies We Carry</h2>\n\n<h3 id=\"open-source\">Open Source</h3>\n\n<p>It goes without saying that the whole RSS3 project, including the standard and protocol itself and all other supporting layers like hosting and indexing should be open source. Everyone should have the right to inspect and understand what the code is and how it works. Also, being open-source gives all developers a direct way to contribute to all parts of the project.</p>\n\n<p>We will encourage all applications that utilize the protocol to be open-source as well. Otherwise, users won’t be trusting them with their valuable private keys. Chances are that malicious and non-open-source applications will be eliminated by market competitions while data monopoly no longer exists.</p>\n\n<p>Right now, people are forced to trust centralized parties for what a internet service actually does. There are of course big brands to trust, like Facebook, Google or Amazon. People used to have the idea that “big brands won’t cheat”, but recent incidents have all reminded us that giving anyone the chance to do evil is equally dangerous. We need transparency.</p>\n\n<h3 id=\"distributed-control\">Distributed Control</h3>\n\n<p>The old RSS was designed to be decentralized but not distributed. And that leads to super sub-centers which still carries too much power similar to centralized architectures. For example, Spotify hosts a great amount of long tail podcasts and, though it still uses RSS for publishing, controls all the RSS files and the audio files.</p>\n\n<p>The ultimate distributed control is to have every cyber persona control its own data. And this means both indexing files and content file should be under distributed hosting, and the right to edit the files are determined by their key pairs like in Bitcoin or Ethereum. However, it is important to note that this key pair that controls ownership can also be changed by their key holder, which will result in transferring or trading of a certain persona.</p>\n\n<p>That being said, we still need to keep in mind that general users will take a pretty long time to adopt this idea of keeping ones keys and controlling ones data with them. There will likely be a gradual process which involves efforts from multiple parties.</p>\n\n<h3 id=\"inclusiveness\">Inclusiveness</h3>\n\n<p>RSS3 and its applications are determined to win against the old giants, so it has to be inclusive in two major ways.</p>\n\n<p>It starts with the inclusiveness regarding types of applications. Any content or social network is defined by its content form and network structure, where network structure is determined by type of links and mechanism of discovery. Facebook, Twitter, Instagram, Whatsapp and TikTok are not that different technically. We need the protocol to support very different types of applications so that innovations can continue to happen.</p>\n\n<p>Then we need the inclusiveness on modules. Whether it is hosting, indexing or monetizing, RSS3 is designed to be extremely open to modules with different functionalities. This gives RSS3 great flexibility and possibility regarding what it can do in the future.</p>\n\n<h2 id=\"the-future-we-aim\">The Future We Aim</h2>\n\n<h3 id=\"empowered-personas\">Empowered Personas</h3>\n\n<p>Cyber personas will truly have full control regarding the data they produce. Any persona can freely express their thoughts and ideas without being censored by any centralized agency. You can go to any application with your own contents and relationships. No platform can ever force you to labor for it anymore. You, no longer the platform, will be empowered to create, own and monetize.</p>\n\n<h3 id=\"platformless-medias\">Platformless Medias</h3>\n\n<p>Medias right now are closely bonded with platforms. Each social media platform has its own social graph and primary form of content. The adoption of RSS3 will give medias a chance to have the largest unified group of subscribers, an efficient monetization channel without platform commission, and a freedom to generate contents of various forms.</p>\n\n<h3 id=\"innovative-applications\">Innovative Applications</h3>\n\n<p>Innovations on user experience has slowed down so dramatically as data superpowers continue to grow. We want to rebuild the prosperous ecology of applications for different user experience to emerge. When users control their data, they can easily choose to move to applications with better design and engineering efforts. Unlike competing for the scale and speed of data monopolizing, now applications will be actually competing for user experience.</p>\n\n<h2 id=\"the-team-we-build\">The Team We Build</h2>\n\n<p>To achieve what we aimed for, we formed a distributed organization with high standard. Every member works on RSS3 comes from his/her/their/its true belief and passion. We share the culture below:</p>\n\n<h3 id=\"mission\">Mission</h3>\n\n<p>To Liberates Contents and Links</p>\n\n<h3 id=\"vision\">Vision</h3>\n\n<p>Build a world where information and its flow are free, secure, efficient and distributed</p>\n\n<h3 id=\"value\">Value</h3>\n\n<ul>\n  <li>Neutrality</li>\n  <li>Inclusiveness</li>\n  <li>Equality</li>\n  <li>Security</li>\n  <li>Privacy</li>\n  <li>Meticulosity</li>\n</ul>\n\n<p>I first was working on an RSS related app in 2018, which led me to the famous RSS project on Github called RSSHub (<a href=\"https://github.com/DIYgod/RSSHub\">https://github.com/DIYgod/RSSHub</a>). The app failed badly and I did not anticipate the experience with that app would do me any favor. I worked on different types of social networks after that and gradually shifted my focus onto decentralized social and content networks. It was not until the second half of 2020, did I suddenly remembered RSSHub and its creator DIYgod (<a href=\"https://diygod.me/\">https://diygod.me/</a>). I connected with him and decided that we could carry some of the best from RSS and build something better. With great help from suji (<a href=\"https://twitter.com/suji_yan\">https://twitter.com/suji_yan</a>), founder at Mask Network, we were able to know more people in the decentralized world and raise our seed round. Suji was actually the first person advised us to change our project name (formerly AIR) to RSS3 :D</p>\n\n<h2 id=\"to-conclude\">To Conclude…</h2>\n\n<p>It is never easy to build something great. Especially when you are confronting the well established giants. However, as developers, we have a firm belief regarding what is right and what should be done. We must dedicate all what we have to overthrow the old world in order to build a new one.</p>\n\n<p>If you want to join us, know more about RSS3 or just want to have a talk, we are always happy to connect :D</p>\n\n<p>All the best ❤️</p>\n\n<p>— Joshua &amp; The RSS3 Team</p>",
      "excerpt": "The right to create, disseminate and distribute information should not be in the hands of centralized governing. It is the basic right of cyber lives.",
      "languages": null,
      "categories": [],
      "tags": []
    }
    
  


]
